update model, README.md, etc
